; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=240, out_folder=./training, instance_id=12, seed=2036, goal_proportion=0.03

(define (problem blocksworld-12)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 b181 b182 b183 b184 b185 b186 b187 b188 b189 b190 b191 b192 b193 b194 b195 b196 b197 b198 b199 b200 b201 b202 b203 b204 b205 b206 b207 b208 b209 b210 b211 b212 b213 b214 b215 b216 b217 b218 b219 b220 b221 b222 b223 b224 b225 b226 b227 b228 b229 b230 b231 b232 b233 b234 b235 b236 b237 b238 b239 b240 - object)
 (:init 
    (arm-empty)
    (clear b140)
    (on b140 b88)
    (on b88 b153)
    (on b153 b167)
    (on b167 b131)
    (on-table b131)
    (clear b76)
    (on b76 b117)
    (on b117 b143)
    (on b143 b183)
    (on b183 b186)
    (on-table b186)
    (clear b29)
    (on b29 b181)
    (on b181 b49)
    (on b49 b21)
    (on b21 b171)
    (on b171 b36)
    (on b36 b206)
    (on b206 b38)
    (on b38 b44)
    (on-table b44)
    (clear b62)
    (on b62 b58)
    (on b58 b173)
    (on-table b173)
    (clear b109)
    (on b109 b30)
    (on-table b30)
    (clear b45)
    (on b45 b163)
    (on b163 b95)
    (on-table b95)
    (clear b12)
    (on b12 b152)
    (on b152 b144)
    (on b144 b240)
    (on b240 b33)
    (on b33 b128)
    (on b128 b193)
    (on b193 b57)
    (on b57 b18)
    (on-table b18)
    (clear b134)
    (on b134 b216)
    (on b216 b86)
    (on-table b86)
    (clear b178)
    (on b178 b156)
    (on-table b156)
    (clear b222)
    (on b222 b50)
    (on b50 b189)
    (on b189 b187)
    (on b187 b67)
    (on-table b67)
    (clear b48)
    (on b48 b195)
    (on b195 b227)
    (on b227 b84)
    (on-table b84)
    (clear b93)
    (on b93 b202)
    (on-table b202)
    (clear b97)
    (on-table b97)
    (clear b60)
    (on b60 b82)
    (on b82 b120)
    (on-table b120)
    (clear b133)
    (on b133 b99)
    (on b99 b184)
    (on-table b184)
    (clear b231)
    (on b231 b10)
    (on b10 b190)
    (on b190 b25)
    (on b25 b127)
    (on-table b127)
    (clear b17)
    (on b17 b55)
    (on b55 b207)
    (on b207 b114)
    (on b114 b230)
    (on b230 b149)
    (on-table b149)
    (clear b175)
    (on-table b175)
    (clear b148)
    (on b148 b155)
    (on-table b155)
    (clear b52)
    (on b52 b161)
    (on b161 b160)
    (on b160 b87)
    (on b87 b218)
    (on-table b218)
    (clear b130)
    (on b130 b176)
    (on b176 b168)
    (on b168 b201)
    (on b201 b9)
    (on-table b9)
    (clear b194)
    (on b194 b119)
    (on b119 b146)
    (on b146 b221)
    (on b221 b47)
    (on b47 b13)
    (on b13 b123)
    (on b123 b228)
    (on b228 b166)
    (on b166 b11)
    (on b11 b180)
    (on b180 b22)
    (on b22 b192)
    (on b192 b229)
    (on b229 b165)
    (on b165 b188)
    (on b188 b24)
    (on-table b24)
    (clear b150)
    (on b150 b196)
    (on b196 b26)
    (on b26 b77)
    (on b77 b185)
    (on b185 b83)
    (on b83 b129)
    (on-table b129)
    (clear b219)
    (on b219 b199)
    (on b199 b139)
    (on b139 b80)
    (on b80 b53)
    (on b53 b198)
    (on b198 b79)
    (on b79 b89)
    (on b89 b138)
    (on b138 b70)
    (on b70 b16)
    (on-table b16)
    (clear b61)
    (on-table b61)
    (clear b238)
    (on-table b238)
    (clear b239)
    (on-table b239)
    (clear b122)
    (on b122 b94)
    (on b94 b69)
    (on b69 b6)
    (on b6 b169)
    (on b169 b113)
    (on b113 b115)
    (on b115 b170)
    (on b170 b217)
    (on-table b217)
    (clear b34)
    (on-table b34)
    (clear b46)
    (on b46 b118)
    (on-table b118)
    (clear b78)
    (on-table b78)
    (clear b2)
    (on b2 b39)
    (on b39 b66)
    (on b66 b177)
    (on b177 b203)
    (on b203 b71)
    (on b71 b197)
    (on b197 b96)
    (on b96 b85)
    (on b85 b204)
    (on b204 b63)
    (on b63 b56)
    (on b56 b103)
    (on b103 b232)
    (on b232 b212)
    (on b212 b101)
    (on b101 b72)
    (on b72 b159)
    (on b159 b234)
    (on b234 b210)
    (on b210 b157)
    (on-table b157)
    (clear b172)
    (on b172 b32)
    (on-table b32)
    (clear b224)
    (on b224 b209)
    (on-table b209)
    (clear b107)
    (on b107 b200)
    (on b200 b90)
    (on-table b90)
    (clear b213)
    (on-table b213)
    (clear b81)
    (on b81 b65)
    (on b65 b27)
    (on b27 b31)
    (on-table b31)
    (clear b64)
    (on b64 b214)
    (on b214 b74)
    (on b74 b182)
    (on b182 b158)
    (on b158 b125)
    (on b125 b162)
    (on b162 b236)
    (on b236 b7)
    (on-table b7)
    (clear b68)
    (on b68 b108)
    (on b108 b116)
    (on b116 b111)
    (on b111 b179)
    (on b179 b91)
    (on b91 b137)
    (on b137 b191)
    (on b191 b14)
    (on b14 b132)
    (on-table b132)
    (clear b73)
    (on-table b73)
    (clear b121)
    (on-table b121)
    (clear b124)
    (on-table b124)
    (clear b135)
    (on b135 b92)
    (on b92 b223)
    (on-table b223)
    (clear b3)
    (on-table b3)
    (clear b1)
    (on b1 b104)
    (on b104 b51)
    (on b51 b28)
    (on b28 b75)
    (on b75 b42)
    (on b42 b145)
    (on b145 b100)
    (on-table b100)
    (clear b136)
    (on-table b136)
    (clear b37)
    (on b37 b19)
    (on b19 b233)
    (on b233 b112)
    (on-table b112)
    (clear b59)
    (on-table b59)
    (clear b43)
    (on b43 b142)
    (on b142 b208)
    (on b208 b215)
    (on b215 b40)
    (on b40 b54)
    (on b54 b211)
    (on-table b211)
    (clear b41)
    (on b41 b105)
    (on b105 b23)
    (on-table b23)
    (clear b205)
    (on-table b205)
    (clear b126)
    (on b126 b226)
    (on b226 b174)
    (on b174 b110)
    (on-table b110)
    (clear b164)
    (on b164 b8)
    (on b8 b235)
    (on b235 b20)
    (on-table b20)
    (clear b98)
    (on b98 b102)
    (on b102 b5)
    (on b5 b141)
    (on-table b141)
    (clear b35)
    (on b35 b4)
    (on b4 b106)
    (on-table b106)
    (clear b220)
    (on b220 b151)
    (on b151 b147)
    (on b147 b154)
    (on b154 b15)
    (on b15 b237)
    (on-table b237)
    (clear b225)
    (on-table b225))
 (:goal  (and 
    (clear b2)
    (on b2 b7)
    (on b7 b1)
    (on b1 b5)
    (on b5 b3)
    (on b3 b6)
    (on b6 b4)
    (on-table b4))))

; plan
1. (unstack b122 b94)
   deleted: (on b122 b94) (clear b122) (arm-empty)
   added: (holding b122) (clear b94)
   goals met: 1 of 8
2. (putdown b122)
   deleted: (holding b122)
   added: (clear b122) (arm-empty) (on-table b122)
   goals met: 1 of 8
3. (unstack b35 b4)
   deleted: (on b35 b4) (clear b35) (arm-empty)
   added: (holding b35) (clear b4)
   goals met: 1 of 8
4. (putdown b35)
   deleted: (holding b35)
   added: (clear b35) (arm-empty) (on-table b35)
   goals met: 1 of 8
5. (unstack b4 b106)
   deleted: (on b4 b106) (clear b4) (arm-empty)
   added: (holding b4) (clear b106)
   goals met: 1 of 8
6. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 2 of 8
7. (unstack b64 b214)
   deleted: (on b64 b214) (clear b64) (arm-empty)
   added: (holding b64) (clear b214)
   goals met: 2 of 8
8. (putdown b64)
   deleted: (holding b64)
   added: (clear b64) (arm-empty) (on-table b64)
   goals met: 2 of 8
9. (unstack b214 b74)
   deleted: (on b214 b74) (clear b214) (arm-empty)
   added: (holding b214) (clear b74)
   goals met: 2 of 8
10. (putdown b214)
   deleted: (holding b214)
   added: (clear b214) (arm-empty) (on-table b214)
   goals met: 2 of 8
11. (unstack b74 b182)
   deleted: (on b74 b182) (clear b74) (arm-empty)
   added: (holding b74) (clear b182)
   goals met: 2 of 8
12. (putdown b74)
   deleted: (holding b74)
   added: (clear b74) (arm-empty) (on-table b74)
   goals met: 2 of 8
13. (unstack b182 b158)
   deleted: (on b182 b158) (clear b182) (arm-empty)
   added: (holding b182) (clear b158)
   goals met: 2 of 8
14. (putdown b182)
   deleted: (holding b182)
   added: (clear b182) (arm-empty) (on-table b182)
   goals met: 2 of 8
15. (unstack b158 b125)
   deleted: (on b158 b125) (clear b158) (arm-empty)
   added: (holding b158) (clear b125)
   goals met: 2 of 8
16. (putdown b158)
   deleted: (holding b158)
   added: (clear b158) (arm-empty) (on-table b158)
   goals met: 2 of 8
17. (unstack b125 b162)
   deleted: (on b125 b162) (clear b125) (arm-empty)
   added: (holding b125) (clear b162)
   goals met: 2 of 8
18. (putdown b125)
   deleted: (holding b125)
   added: (clear b125) (arm-empty) (on-table b125)
   goals met: 2 of 8
19. (unstack b162 b236)
   deleted: (on b162 b236) (clear b162) (arm-empty)
   added: (holding b162) (clear b236)
   goals met: 2 of 8
20. (putdown b162)
   deleted: (holding b162)
   added: (clear b162) (arm-empty) (on-table b162)
   goals met: 2 of 8
21. (unstack b236 b7)
   deleted: (on b236 b7) (clear b236) (arm-empty)
   added: (holding b236) (clear b7)
   goals met: 2 of 8
22. (putdown b236)
   deleted: (holding b236)
   added: (clear b236) (arm-empty) (on-table b236)
   goals met: 2 of 8
23. (unstack b94 b69)
   deleted: (on b94 b69) (clear b94) (arm-empty)
   added: (holding b94) (clear b69)
   goals met: 2 of 8
24. (putdown b94)
   deleted: (holding b94)
   added: (clear b94) (arm-empty) (on-table b94)
   goals met: 2 of 8
25. (unstack b69 b6)
   deleted: (on b69 b6) (clear b69) (arm-empty)
   added: (holding b69) (clear b6)
   goals met: 2 of 8
26. (putdown b69)
   deleted: (holding b69)
   added: (clear b69) (arm-empty) (on-table b69)
   goals met: 2 of 8
27. (unstack b98 b102)
   deleted: (on b98 b102) (clear b98) (arm-empty)
   added: (holding b98) (clear b102)
   goals met: 2 of 8
28. (putdown b98)
   deleted: (holding b98)
   added: (clear b98) (arm-empty) (on-table b98)
   goals met: 2 of 8
29. (unstack b102 b5)
   deleted: (on b102 b5) (clear b102) (arm-empty)
   added: (holding b102) (clear b5)
   goals met: 2 of 8
30. (putdown b102)
   deleted: (holding b102)
   added: (clear b102) (arm-empty) (on-table b102)
   goals met: 2 of 8
31. (unstack b6 b169)
   deleted: (on b6 b169) (clear b6) (arm-empty)
   added: (holding b6) (clear b169)
   goals met: 2 of 8
32. (stack b6 b4)
   deleted: (clear b4) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b4)
   goals met: 3 of 8
33. (pickup b3)
   deleted: (clear b3) (on-table b3) (arm-empty)
   added: (holding b3)
   goals met: 3 of 8
34. (stack b3 b6)
   deleted: (clear b6) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b6)
   goals met: 4 of 8
35. (unstack b5 b141)
   deleted: (on b5 b141) (clear b5) (arm-empty)
   added: (holding b5) (clear b141)
   goals met: 4 of 8
36. (stack b5 b3)
   deleted: (clear b3) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b3)
   goals met: 5 of 8
37. (unstack b1 b104)
   deleted: (on b1 b104) (clear b1) (arm-empty)
   added: (holding b1) (clear b104)
   goals met: 5 of 8
38. (stack b1 b5)
   deleted: (clear b5) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b5)
   goals met: 6 of 8
39. (pickup b7)
   deleted: (clear b7) (on-table b7) (arm-empty)
   added: (holding b7)
   goals met: 6 of 8
40. (stack b7 b1)
   deleted: (clear b1) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b1)
   goals met: 7 of 8
41. (unstack b2 b39)
   deleted: (on b2 b39) (clear b2) (arm-empty)
   added: (holding b2) (clear b39)
   goals met: 6 of 8
42. (stack b2 b7)
   deleted: (clear b7) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b7)
   goals met: 8 of 8
